Revit 2027 API
ParameterTypeId.MaterialName Property
 "Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialName { get; }
Public Shared ReadOnly Property MaterialName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialName {
	ForgeTypeId^ get ();
}
static member MaterialName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace